#!/usr/bin/env bash

change_str=$(git status -s)

if [[ -z ${change_str} ]]
then
  echo '===================================='
  echo '仓库没有变化的东西，直接进行更新'
  echo '===================================='
  git pull gitee master
  echo '===================================='
  echo "更新完成............................."
  echo '===================================='
  sleep 5
  exit
else
  echo '===================================='
  echo ${change_str}
  echo '===================================='
fi

read -p "是否在远端已经保存了变化，y/n:    " enter_key

if [ "${enter_key}" = "y" ];then
  echo '===================================='
  echo "将撤销所有的更改........."
  echo '===================================='
  # 回滚到最近的提交的一个版本，撤消对跟踪文件的更改
  git reset --hard HEAD~0
  # 删除未跟踪的文件和目录
  git clean -fd
else 
  echo '===================================='
  echo "请去远端gitee_web保存变化>>>>>>>>>>>>>"
  echo '===================================='
  sleep 5
  exit
fi

git pull gitee master

echo "===================================="
echo "更新完成................................."
echo "===================================="
sleep 5